Revit 2024 API
DWFXExportOptions Class
DWFX Export options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class DWFXExportOptions : DWFExportOptions
Visual Basic
Public Class DWFXExportOptions _
	Inherits DWFExportOptions
Visual C++
public ref class DWFXExportOptions : public DWFExportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CADExportOptions
 Autodesk.Revit.DB.DWFExportOptions
 Autodesk.Revit.DB.DWFXExportOptions
See Also
DWFXExportOptions Members
Autodesk.Revit.DB Namespace